package com.example.rvanimationtest.utils;

import com.example.rvanimationtest.Models.NewsItem;
import com.example.rvanimationtest.R;

import java.util.ArrayList;
import java.util.List;

public class DataSource {

    public static List<NewsItem> getNewsItems() {

        List<NewsItem> newsList = new ArrayList<>();
        newsList.add(new NewsItem("Білоруські айтішники тікають до України",
                "У зв'язку з жорстоким розгоном протестів у Білорусі IT-компанії вивозять, а деякі планують вивезти частину співробітників. Україну називають однією з країн, куди переїздять білоруські айтішники.",
                "26 серпень 2020", R.drawable.male));
        newsList.add(new NewsItem("Країни, які вимикають інтернет. Як і навіщо вони це роблять",
                "Деякі держави вдаються до особливого виду репресій – позбавляють громадян доступу до інтернету.",
                "11 серпень 2020", R.drawable.female));
        newsList.add(new NewsItem("Філарет захворів на Covid-19. Він у лікарні",
                "Почесний патріарх Православної церкви України Філарет підхопив коронавірус.",
                "4 вересень 2020", R.drawable.male2));
        newsList.add(new NewsItem("Коронавірус в Україні. Інтерактивна мапа",
                "В якій області найбільше інфікованих коронавірусом? Скільки одужало? А скільки померло? Все це - на нашій інтерактивній мапі.",
                "4 вересень 2020", R.drawable.male3));
        newsList.add(new NewsItem("Російська радіостанція-привид. Кому вона передає свої моторошні сигнали",
                "Радіостанція МДЖБ, або \"Дзижчалка\", веде свої дивні передачі на коротких хвилях з 1982 року. Кому призначене це дзижчання і зачитування в ефірі безглуздих цифр і слів?",
                "9 серпень 2020", R.drawable.female2));
        newsList.add(new NewsItem("Сигнал від злиття чорних дір пролетів 7 млрд років і \"сколихнув\" Землю",
                "Уявіть, як енергія восьми Сонць в один момент вивільняється у простір. Відголоски цього йшли до Землі 7 млрд років, але їх змогли зафіксувати вчені.",
                "3 вересень 2020", R.drawable.male5));
        newsList.add(new NewsItem("Країни, які вимикають інтернет. Як і навіщо вони це роблять",
                "Деякі держави вдаються до особливого виду репресій – позбавляють громадян доступу до інтернету.",
                "11 серпень 2020", R.drawable.male4));
        newsList.add(new NewsItem("Філарет захворів на Covid-19. Він у лікарні",
                "Почесний патріарх Православної церкви України Філарет підхопив коронавірус.",
                "4 вересень 2020", R.drawable.female2));
        newsList.add(new NewsItem("Коронавірус в Україні. Інтерактивна мапа",
                "В якій області найбільше інфікованих коронавірусом? Скільки одужало? А скільки померло? Все це - на нашій інтерактивній мапі.",
                "4 вересень 2020", R.drawable.male));
        newsList.add(new NewsItem("Білоруські айтішники тікають до України",
                "У зв'язку з жорстоким розгоном протестів у Білорусі IT-компанії вивозять, а деякі планують вивезти частину співробітників. Україну називають однією з країн, куди переїздять білоруські айтішники.",
                "26 серпень 2020", R.drawable.male2));
        newsList.add(new NewsItem("Країни, які вимикають інтернет. Як і навіщо вони це роблять",
                "Деякі держави вдаються до особливого виду репресій – позбавляють громадян доступу до інтернету.",
                "11 серпень 2020", R.drawable.female));
        newsList.add(new NewsItem("Філарет захворів на Covid-19. Він у лікарні",
                "Почесний патріарх Православної церкви України Філарет підхопив коронавірус.",
                "4 вересень 2020", R.drawable.male3));
        newsList.add(new NewsItem("Коронавірус в Україні. Інтерактивна мапа",
                "В якій області найбільше інфікованих коронавірусом? Скільки одужало? А скільки померло? Все це - на нашій інтерактивній мапі.",
                "4 вересень 2020", R.drawable.male5));
        newsList.add(new NewsItem("Російська радіостанція-привид. Кому вона передає свої моторошні сигнали",
                "Радіостанція МДЖБ, або \"Дзижчалка\", веде свої дивні передачі на коротких хвилях з 1982 року. Кому призначене це дзижчання і зачитування в ефірі безглуздих цифр і слів?",
                "9 серпень 2020", R.drawable.female2));

        return newsList;
    }
}
